//*----------------------------------------------------------------*
//*--------- SORT BASIC STRUCTURE USING CARDLIB -------------------*
//*----------------------------------------------------------------*
//*--------- FILE SCRATCH -----------------------------------------*
//*----------------------------------------------------------------*
//SYS000     EXEC PGM=SYS000,                    ***RESTART POINT***
//           PARM='&HLQ..ARQOUT.D&DTMOV..SS000101'
//*----------------------------------------------------------------*
//*--------- SORT EXECUTION ---------------------------------------*
//*----------------------------------------------------------------*
//SORT       EXEC PGM=SORT
//SYSOUT     DD   SYSOUT=*
//SORTIN     DD   DSN=&HLQ..ARQIN.D&DTMOV..SS000101,
//           DISP=SHR
//SORTOUT    DD   DSN=&HLQ..ARQOUT.D&DTMOV..SS000101,
//           DISP=(,CATLG),LRECL=8,RECFM=FB,DSORG=PS,
//           AVGREC=K,SPACE=(8,(10,1),RLSE)
//SYSIN      DD   DSN=&CARDLIB(CARDSORT),DISP=SHR
//*----------------------------------------------------------------*
