   SORT FIELDS=(001,002,BI,A,     /* FIRST  VARIABLE TYPE SMALLINT ( PIC 9(004) COMP.)
                003,005,BI,A,     /* SECOND VARIABLE TYPE INTEGER  ( PIC 9(009) COMP.)
                049,009,PD,A,     /* THIRD  VARIABLE TYPE DECIMAL  ( PIC 9(015)V9(02) COMP-3.) 
                093,020,CH,A)     /* FOURTH VARIABLE TYPE CHAR     ( PIC X(020).)